# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Formulae
brew "age"
brew "ascii"
brew "autoconf"
brew "chezmoi"
brew "clang-format"
brew "cppcheck"
brew "curl"
brew "docker"
brew "docker-completion"
brew "dos2unix"
brew "doxygen"
brew "flawfinder"
brew "fswatch"
brew "ghc"
brew "haskell-stack"
brew "lizard"
brew "llvm"
brew "maven"
brew "neovim"
brew "node"
brew "openjdk"
brew "pandoc"
brew "php"
brew "pipx"
brew "python@3.13"
brew "ruby"
brew "tmux"
brew "tmuxinator"
brew "typst"
brew "wget"
brew "zsh"

# Casks
cask "activitywatch"
cask "amethyst"
cask "gstreamer-runtime"
cask "wine-stable"

# Development Tools
brew "bat"
brew "diffutils"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "grep"
brew "jq"
brew "node"
brew "pnpm"
brew "postgresql", restart_service: true
brew "ripgrep"
brew "wget"

brew "yarn"

# Applications
cask "1password"
cask "airflow"
cask "alfred"
cask "airtable"
cask "android-platform-tools"
cask "arq"
cask "diffusionbee"
cask "discord"
cask "disk-inventory-x"
cask "dropbox"
cask "firefox"
cask "handbrake"
cask "imageoptim"
cask "iterm2"
cask "messenger"
cask "notion-calendar"
cask "obs"
cask "plex"
cask "protonvpn"
cask "qlvideo"
cask "raycast"
cask "rectangle-pro"
cask "skype"
cask "slack"
cask "sonos"
cask "steam"
cask "sublime-text"
cask "syncalicious"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "windsurf"
cask "zoom"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
